import { TreeNode } from "../index"

export const financial: TreeNode = {
    label: "Financial",
    children: [
        {
            label: "expenses",
            children: [
                {
                    label: "Family expenses",
                    children: [
                        {
                            label: "alimony of dhusband or wife (ค่าเลี้ยงดูสามีหรือภรรยา)",
                            children: [],
                            isLeaf: true,
                            examples: [
                                `คู่สามี ภรรยาคู่ไหนที่อยู่ด้วยกันแบบแบ่งเบาภาระหน้าที่กันบ้างไหม  เช่นแต่ละนรับผิดชอบค่าใช้จ่ายกันคนละส่วนแต่รับผิดชอบกับแทบจะคนละครึ่ง

                                ทางเราสามีไม่รับผิดชอบค่าใช้จ่ายเลย บอกว่าแค่เขารับผิดชอบตัวเองไม่เป็นภาระเราก็ดีแค่ไหนแล้ว เงินเดือน 9000  เงินออกก็สั่งของมาแต่งรถ ไม่เคยซื้อขนมให้ลูกสักบาท กลางวันกินข้าวนอกบ้านทุกวัน เติมน้ำมันขี่รถเล่นกับเพื่อน อายุ 24 นะคะสามี
                                 เขาบอกขอร้องเถอะเรื่องเงินน่ะอย่าเดือดร้อนเขาแค่เขาดูแลตัวเองก็ลำบากพอละ เราขอเลิกเขาบอกเรานี่โคตรปัญญาอ่อน ทำไมแค่รักกันไม่พอหรอ แค่เขาไม่ได้ซัพพอร์ตเรา แค่นี้ต้องเลิก ไม่มีใครเขาทำกัน อยู่ด้วยใจมันอยู่ยาว แต่เราเองที่ไม่ซื่อสัตย์ ค่าใชจ่ายเดือนละ60000 เราผิดแหละที่เอาเขามาทำผัว แค่อยากให้เขาจ่ายค่าไฟให้ เดือนละ 4000 มันคงมากไปสำหรับเขา เตือนนะคะรักอย่างเดียวไม่พอถ้าไม่ดีพอ มันรักกันช่วงแรกๆแต่มันไม่สมกัน อยู่ไปนานๆมันไม่ได้จริงๆ คนนึงหาเงินเก็บเงินคนนึงหาใช้ไปวันๆไร้จุดมุ่งหมาย สภาพตอนนี้เขาไม่น่าจะใช่ผัวเราค่ะ ติดกี เมายา`
                            ]
                        },
                        {
                            label: "alimony of parents (ค่าเลี้ยงดูพ่อแม่)",
                            children: [],
                            isLeaf: true,
                            examples: [
                                "เรื่องมีอยู่ว่าแต่งงานออกมาอยู่กับภรรยา ต่างคนต่างส่งเงินให้ที่บ้านของตัวเอง ผมส่งให้ที่บ้านเดือนละ 10,000 เพราะที่บ้านมีแค่แม่กับหลาน น้องชายและน้องสาวก็มีงานทำแต่ไม่รู้ว่าเขาส่งมั๊ย ส่วนภรรยาผมส่งเงินให้ที่บ้านเดือนละ 25,000+ เพราะต้องส่งน้องสองคนเรียน ซึ่งเมื่อแม่ผมรู้ก็ไม่พอใจว่าทำไมให้ทางนั่นเยอะกว่าผมก็พยายามอธิบายว่าเขาต้องส่งน้องเรียน และมันเป็นเงินส่วนที่เขาหา ซึ่งปกติเงินที่ใช้ในชีวิตประจำวันเราจะออกคนละครึ่งอยู่แล้วรวมถึงเงินเก็บ ที่เหลือก็จะส่งให้ที่บ้านของใครของมัน  แล้วแม่มาหาว่าผมเห็นเมียดีกว่า บอกว่าให้เมียจูงจมูก หาว่าผมอกตัญญูแบบนี้มันได้หรอครับ  ผมยังมีบ้าน มีรถที่ต้องผ่อน  เงินที่ผมให้ไปมันก็ไม่ได้น้อย  แล้วเอาไปพูดกับแถวบ้านว่าผมมันไม่ดี บอกเมียผมไม่ยอมให้ผมส่งเงินให้เขาบ้าง",
                            ]
                        },
                        {
                            label: "Tuition fee (ค่าเล่าเรียน)",
                            children: [],
                            isLeaf: true,
                            examples: [
                                "ทุกคนคิดไงกับน้องสาวที่ร้องจะเอาไอโฟนโดยที่ไม่สนเลยว่าที่บ้านการเงินเป็นยังไง(ม.เอกชน)แค่ค่าเทอมก็จะไม่ไหวแล้ว😒",

                            ]
                        },
                    ]
                },
                {
                    label: "Property installment (ผ่อนทรัพสินต่างๆ)",
                    children: [
                        {
                            label: "Interest (ดอกเบ่ี้ย)",
                            children: [],
                            isLeaf: true,
                            examples: [
                                `พ่อสร้างหนี้รายวันไวเป็นแสน
                                8-9เจ้า เจ้าละ30000-20000-10000
                                แต่ไม่รู้พ่อเอาเงินไปไหนหมด เอารถไปจำดอกร้อยละ10 2คัน คือตอนนี้หนูลาออกจากงานเพื่อมาอยู่ขายของใช่หนี้แทนพ่อ เหนื่อยกับพ่อมากเลยค่ะตอนนี้`,
                                `เครียดจังเลยค่ะ ติดหนี้300 กู้จากในเฟสมา ราย3 วัน คืน450 ตอนนี้ก็เกินเวลารวมค่าปรับ ยอดรวม590 กำลังจะโดนประจานในเพจจังหวัดอีกไม่กี่ชั่วโมงข้างหน้านี้ค่ะ ขอผ่อนก็แล้ว เค้าไม่ยอมทุกอย่าง จำเป็นต้องกู้มาไว้กินไว้ใช้ค้ะ😭`
                            ]
                        },
                        {
                            label: "installment",
                            children: [],
                            isLeaf: true,
                            examples: [
                                `สวัสดีครับ ขอปรึกษา หน่อยครับ คือ ครอบครัวเมียผม มันไม่อยากให้ เมียผมทำงานช่วยกัน ผมทำงานคนเดียวเงินเดือน17,500ผ่อนทั้งบ้านทั้งรถรวมกินใช้จ่ายในครอบครัวทุกอย่าง มันพอนั้นแหละ แต่มันต้อง อยู่อย่างประหยัด วันไหนเมียผม คิดจะช่วยทำงานหาเงิน กลับมาเหนื่อยๆ เมียผมโดนแม่ของเข้าด่า ดูถูก ว่า ทำงานทำไม อยู่บ้านเลี้ยงลูกเถอะ ไม่ปวดหัวบ้างหรอเป็นหนี้ รถหนี้บ้าน ผมจะบอกอะไรให้  สมบัติ ของแม่มัน ไม่มี อะไรให้ลูกเลย ได้แต่ตอกย้ำซ้ำเติม ถ้าคิดจะ  ทำงานหาแดกไปวันๆ ไม่สร้างอะไร สบายครับ เงินเดือนผม เลี้ยงได้ สบาย 17,500ถ้าเอามากินอย่างเดียว แต่ไม่มี เหี้ยอะไรเลย น่ะ  พี่ๆคิดยังไง กับความคิด ของบ้านนั้น  ผมหนักใจ ไม่รู้จะไปต่อหรือพอแค่นี้`
                            ]
                        },
                    ]
                },
            ]
        },
        {
            label: "low income (รายได้น้อย)",
            children: [
                {
                    label: "Salary is not enough",
                    children: [],
                    isLeaf: true,
                    examples: [
                        `ขอคำแนะนำค่ะ เครียดเรื่องค้าขายมาก เดิมทีในตลาดเราขายน้ำอยู่เจ้าเดียวมาหลายปี รายได้พอจุนเจือครอบครัว ทีนี้มาวันก่อนมีเจ้าใหม่มาลงขายทุกอย่างเหมือนกัน ร้านเขาทำมาใหม่ มีท๊อปปิ้งหลากหลาย แล้วมาตั้งอยู่ข้างหลังเราเลย สมมุติจากที่ได้1000 ยอดก็ลดลงเหลือ7-800 ตลาดนี้จะเป็นของเทศบาลโดยปิดถนนตอนเย็นดูแลโดยเทศบาล แต่ร้านใหม่มาตั้งอยู่หน้าบ้านซึ่งไม่เกี่ยวกับเทศบาล เราเลยไม่รู้จะบอกกับใครดี ถ้าตั้งออกห่างไปหน่อยจะไม่ว่าอะไรเลย นี่มาตั้งด้านหลังเราเลย ยิ่งคิดยิ่งเครียด เราควรทำอย่างไรดีคะ`,
                        `ถ้าเราจะทำกับข้าวเร่ขายตามหมู่บ้าน ทุกคนในกลุ่มคิดว่าน่าอายมั้ยคะ *เรามีฐานะพอสมควรแต่พ่อแม่หยุดให้เงินเราแถมจ้องจะสมน้ำหน้าเราตลอดเวลา 
                        *เอาจริงเราก็อายแหละพ่อแม่มีรายได้หลักหมื่นต่อวันส่วนเราคงได้แค่หลักสิบหลักร้อยแกคงสมเพชเรามากๆที่เราเป็นแบบนี้ ทุกคนคิดยังไงกับคนที่เค้าหาเช้ากินค่ำบ้าง เรารู้สึกเหมือนเราตกอับยังไงก็ไม่รู้ จากชีวิตที่สุขสบายต้องมาหาเงินใช้เองแบบนี้ 😔`
                    ]
                },
                {
                    label: "lose a job (ตกงาน)",
                    children: [],
                    isLeaf: true,
                    examples: [
                        `คือว่า เเฟนตกงานไป2อาทิตพึ่งได้งานใหม่สิ้นเดือนไม่พอใช้ เลยจำเป็นต้องเอารถไปจำ 20000บาท หนี้ 18000รวมใช้ค่าไฟค่าเน็ตค่านมแล้ว   เงินที่เก่าได้1000 เหลือจากยอดกู้มา 2000  เหลือค่ากิน 4คน 3000  แม่เราขอแฟนใช้หนี้แม่ 4000  แต่แฟนบอกไม่ให้เพราะแค่นี้ยังไม่พอเลย  แม่เราบอกถ้าไม่ได้ก็ให้ลูกเราเดินไปเรียนเองเขาจะไม่ไปส่งให้ แล้วต่อไปไม่ต้องปรึกษาขอขนาดนี้ไม่ให้ก็เกินไป ทำไมต้องมาลำบากไปส่งด้วยแค่นี้กูก็ลำบากจะแย่แล้ว..  คือเราผิดไหมคะเราหนักใจมากๆค่ะ   ถ้าเขาไม่ไปส่งคือแฟนจะไปเอารถกับแม่เขามาค่ะ`,
                        `ชีวิตที่ล้มเหลวในวัย26 (กำลังจะเริ่มใหม่)
                        เราเป็นเด็กต่างจังหวัด เป็นลูกคนเดียว มาเรียนปริญญาเเละทำงานในกทม.(ส่งตัวเองเรียน ทำงานpart time)
                        หลังจบออกมาทำงาน ส่งเงินให้พ่อเเม่ใช้ เราพยายามตั้งใจทำงาน คิดเเพลนชีวิตครอบครัวตัวเองทุกๆวัน 
                        
                        เเต่เราดันตกงานค่ะ ไล่หางานได้งานก็มีปัญหาเรื่องเงินๆทองจนต้องเเจ้งกรมเเรงงาน ต้องเวียนหางานใหม่ เอาทุนเงินเก็บออกมาใช้ผ่อนรถยนต์ ที่เราดาวน์ออกมาด้วยตัวเอง ค่าห้อง ค่ากิน ก่อนจะได้รับเงินเดือนของที่ใหม่ค่ะ 
                        
                        เมื่ออาทิตย์ที่เเล้วก่อนเงินออกเราเหลือเงินอยู่ติดตัว 500 บาท เรากลัวติดตัวไม่พอเงินออก จึงโทรไปขอยืมเงินซัก 500บาท เเต่สิ่งที่พ่อเเม่ครอบครัวพูดกลับมาคือไม่มี เเล้วไม่ได้ส่งเงินมาให้จะมาขอ ไม่มีไรทั้งนั้น พูดในเเนวว่าเอาตัวไม่รอด..
                        
                        รู้สึกเเย่มากๆเลยค่ะ ทั้งที่ทุกวันนี้ก็ตั้งใจทำงานเพื่อให้ครอบครัวสบาย ไม่มีใครอยากล้มเหลวหรือมาอยู่ในจุดนี้เลยค่ะ น้อยใจในโชคชะตาทั้งๆที่ในชีวิตเราไม่เคยขออะไรจากท่านเลย ยิ้มหัวเราะทั้งนําตา555555 เเล้วก็ไปขอข้าววัดทานค่ะ เพื่อเก็บ 500 ไว้เป็นค่าเดินทางซื้อนํา
                        
                        วันนี้เงินเดือนออก กดออกมากินก๋วยเตี๋ยวยิ้มทั้งนําตาเลยค่ะ555555 มองตัวเองที่กระจก ขอบคุณที่อดทนนะตัวเรา`
                    ]
                }
            ],
        },
        {
            label: "Financial knowledge",
            children: [
                {
                    label: "Improper loan (กู้เงินผิดวิธี)",
                    children: [],
                    isLeaf: true,
                    examples: [
                        `ขออนุญาติ ระบายคะ
                        ตอนนี้เราอายุ35 เรามีแต่หนี้ เริ่มต้นจากก้อนเล็ก สุดท้ายมากมาย เพราะเรา กู้หนี้ มาจ่ายหนี้ เราไม่มีงานทำแล้วตอนนี้ เราสมเพสตัวเองมาก เงินติดตัวสักบาท ยังไม่มี คนมาทวงแต่หนี้ตอนนี้ เราเกรงใจเจ้าหนี้ทุกคน เราตันไปหมดตอนนี้  เรามีข้าวกินเพราะบ้านแม่ แต่เราไม่อยากให้เขารับรู้ปันหาแย่ๆของเรา ชีวิตดูสิ้นหวังเหลือเกิน เราเป็นไมเกรนเรื้อรัง เราเป็นซึมเศร้าเราต้องกินยาตลอด เราอยากตายเหลือเกิน ชีวิตหนึ่งชีวิต ขนาดตัวเราเองยังดูตัวเองไร้ค้า แล้วคนอื่นคงมองเราไม่ต่างจากเรามองตัวเองว่าไร้ค่า เราต้องทำอย่างไรต่อ มันสิ้นหวัง ชีวิตมันพัง เราอยากหลับไปเลยยาวๆ`
                    ]
                },
                {
                    label: "The money is not managed properly (ไม่จัดการเงินอย่างถูกวิธี)",
                    children: [],
                    isLeaf: true,
                    examples: [
                        `พ่อสร้างหนี้รายวันไวเป็นแสน
                        8-9เจ้า เจ้าละ30000-20000-10000
                        แต่ไม่รู้พ่อเอาเงินไปไหนหมด เอารถไปจำดอกร้อยละ10 2คัน คือตอนนี้หนูลาออกจากงานเพื่อมาอยู่ขายของใช่หนี้แทนพ่อ เหนื่อยกับพ่อมากเลยค่ะตอนนี้`
                    ]

                },
                {
                    label: "debt",
                    children: [],
                    isLeaf: true,
                    examples: [
                        `ใครเป็นแบบเราบ้าง
                        อายุ35ยังไม่ทีเงินเก็บ มีแต่หนี้สิน
                        เหนื่อยเบื่อ`,
                    ]
                },
            ]
        },
        {
            label: "gambling",
            children: [],
            isLeaf: true,
            examples: [
                `คบกับแฟนมา3ปีแฟนเป็นคนติดพนันออนไลน์มากทุกๆเดือนจะต้องทะเลาะกันเรื่องนี้ตลอด และเขาสร้างหนี้มาเรื่อยๆเพราะเรื่องพนัน ท้อมากเหนื่อยด้วย เตือนอะไรไปเขาก็ไม่ฟัง เขาเคยสัญญาว่าจะไม่กลับไปเล่นอีกแต่ก็ยังกลับไปเล่นอีก ต้องทำยังไงดีหรือต้องเลิกไปเลย เหนื่อยมากๆเลย😭😭`,
                `แฟนติดสล็อตมาก วันนี้เขาเติม100เล่นได้1000
                เขาไม่คิดจะบอกหนุอยุ่ๆเขาบอกออกไปใช้หนี้นะ หนุก้อให้เขาไปพอเขากลับมาหนุเช้คแอป เขาใช้ไป400เขาติมเกมอีก250เหลือ350ล่าสุดตอนเย้น ตกดึกเขาเล่นอีกตอนนี้เหลือเท่าไรไม่รุ้ หนุอยากให้เขาลดลงบ้างอยากให้เกบเงินบ้างเคยพาลุกหนีเขาไปที่อื่นเพราะเอาตังที่ต้องพาลุกไปหาหมอมาเล่นเกม หนุควรทำยังไงกับเขาดีคะ เครียดมากค่ะ พอบ่น เจาก้อบอกลำคาน ทะเลาะกันอีก`
            ]
        },
    ]
}