import { TreeNode } from "../index"

export const memtalIllness: TreeNode = {
    label: "Mental Illness",
    children: [
        {
            label: "Suicidal Thoughts",
            children: [],
            examples: [
                "ทำไมอยู่ๆก็เกิดความรู้สึกเศร้าและกลัว ทำไมอยู่ๆก็รู้ว่าสึกทุกวันก็อยู่ตัวคนเดียว ทำไมอยู่ๆก็รู้สึกตัวเองแย่ ทำไมอยู่ๆก็รู้สึกไม่อยากมีชีวิตอยู่ ทำไมอยู่ๆตัวเองก็รู้สึกอ่อนแอ ทำไมอยู่ๆบ้างวันถึงนอนไม่หลับ เมื่อไหร่ความรู้สึกต่างๆมากมาย ทำไมคนที่ดีๆถึงอยู่ห่างไกล ทั้งๆที่บอกตัวว่าเราทำได้ แต่สุดท้าย พอถึงเวลาจริงๆกลับรู้สึก ไม่มีความสุขเลย ขอโทษ",
                "แม่ก็มาป่วย เราก็ปวดหัวเครียดมาก อยากจะไปเริ่มต้นชีวิตใหม่ เงินก็ไม่พอ ไม่อยากอยู่เลย มีหนทางและมีโอกาสแต่ก็ทำได้ไม่ได้ ชีวิตก็ใกล้จะดับลง คิดทุกวันไปแบบไม่รู้ไม่เห็นดีกว่าไหม แล้วถ้าไปสู้แบบมือเปล่า แรงพลังจะไหวไหม ทุกวันนี้ร่างกายก็แย่ ทำไมชีวิตถึงไม่มีความรู้สึกอยากอยู่เลย สุดท้ายชีวิตก็ต้องตายแบบทรมาน",
            ]
        },
        {
            label: "Toxic Environment",
            children: [
                {
                    label: "Lack of support/Loneliness",
                    children: [],
                    examples: [
                        "เราเป็นคนไม่มีเพื่อน ไม่มีที่คุยไม่มีที่ระบาย ไม่มีที่ปรึกษา เวลาอยากได้ที่คุยที่ระบาย ก็ทำได้แค่ เก็บไว้คนเดียว จนตอนนี้รู้ตัวแล้วว่ามันไม่ไหว มันเหมือนทั้งโลกกำลังรุมเรา รู้สึกเหมือนเป็นตัวปัญหา ไม่มีความสุข ไม่มีกำลังใจอะไร ท้อแท้ไปหมด อยากตัดปัญหาด้วยการหายไปจากโลกนี้  แต่ไม่กล้าทำนึกถึงลูกในท้อง นึกถึงลูกที่มีชีวิตอยู่ก็พอให้อยู่ต่อได้  แต่บางทีอารมณ์ชั่ววูบมันก็ทำให้รู้สึกแบบไม่ไหวแล้วนะ เพียงแค่อยากได้ใครสักคน ที่คอยให้คำปรึกษา และเข้าใจ และพาไปมองโลกในแง่บวก แต่หันไปทางไหน ก็ไม่มี",
                        "เศร้า เหงา คิดถึง ท้อเหลือเกิน จะพูดกับใครก็ไม่ได้ คนอื่นเค้ามีครอบครัว มีงานมีการทำกันทั้งนั้น ใครจะมาว่างเอาใจคนที่เลือดคั่งในสมองแบบเราได้ทั้งวัน หากต่อไปถึงเวลาใส่กระโหลกเทียมผ่าตัดแล้วเราไม่รอดก็เชิญมาเอาชีวิตเราได้ก็เอาไปเลย โลกนี้ไม่เหมาะสำหรับคนอ่อนแออย่างเรา อุบัติเหตุก็เจอแล้ว พลัดพรากจากสิ่งที่รักก็เจอแล้ว สิ่งที่เราพยายามช่วยเหลือตายไปต่อหน้าต่อตาโดยที่เราไม่ได้ตั้งใจเลยก็เจอแล้ว ตัดสินใจผิดพลาดก็เจอแล้ว เพราะฉะนั้น เราไม่เสียดายชีวิตแล้ว ขออย่างเดียวอย่าให้เราตกนรกก็พอ"
                    ]
                },
                {
                    label: "Devalue/Defame (ด้อยค่า)",
                    children: [],
                    examples: [
                        "อยากระบายมากคือไม่รู้ว่าตัวเองเป็นโรคซึมเศร้ามั้ย ตอนนี้คือโดนล้อหนักมากว่าเป็นเมียคนบ้าคนใบ้ก็ไม่เข้าใจว่าจะล้อทำเชี้ยไรอ่ะแม่งล้อก็ไม่คิดถึงความรู้สึกคนอื่น อยู่โรงเรียนก็ล้อว่าชอบคนนั้นคนนี้คือเราก็มีควาสรู้สึกเหมือนกันอ่ะถ้าล้อตอนอยู่สองคนไม่ว่านะแต่มีพวกพี่เขาอยู่ด้วยเราอยากจะหมุดหน้าลงดิน แอบร้องไห้บ่อยนะแต่ไม่ร้องให้ใครเห็น"
                    ]
                },
            ]
        },
        {
            label: "Healthcare",
            children: [
                {
                    label: "Medication related (Not taking medications, side effects, etc.)",
                    children: [],
                    isLeaf: true,
                    examples: [
                        "เราหยุดยามา 6 เดือนแล้วใช้ชีวิตปกติมากไปพลาดตรงที่กินไฟเบอร์ยี่ห้อนึงแค่ครั้งเดียว หลังจากนั้น ชีวิตก็เปลี่ยนไปเลย แพนิค กลับมารุนแรง อยากจะร้องไห้มาก ขอโทษตัวเองอยู่ตลอด ลำไส้แปรปรวน กินอะไรไม่ได้นอนไม่หลับใจสั่นจะขาดใจตาย แน่นจุก อาหารไม่ย่อย จนต้องกลับมากินยาจิตเวชอีกครั้งเศร้ามาก โกรธตัวเองมาก อยากขอโทษตัวเองที่สุด",
                        "อ้วนจากยาซึมเศร้าเยอะมาก ทำยังไงดี มีใครพอแนะนำได้บ้างคะ ว่าควรทานยาลดความอ้วนได้มั๊ยคะ"
                    ]
                },
                {
                    label: "No Improvement after using healthcare service",
                    children: [],
                    examples: [
                        "อาการตอนนี้บอกไม่ถูกเลย จะวูบ จะช๊อค\n เวียนหัว ปวดหัว ปวดที่หัวใจ จี๊ดๆ แปล๊บๆ ลุกเดินแต่ละที กลัวจะล้มไป ปวดท้องถ่ายก็ไม่กล้าเข้าห้องน้ำ โรคเวรโรคกรรม ไม่ตาย แต่เอาเราให้ทรมานสุดๆ เหนื่อยที่จะสู้ บางครั้งคุยกะหมอ กะเหมือนจะไม่มีอะไรผิดปกติ ลดยาบ้าง กินยาตัวเดิมบ้าง สรุป อะไรก็ไม่ดีขึ้น ทุกวันนี้นอนสวดมนต์ ทุกครั้งเท่าที่มีแรงนั่ง ภาวนาให้เจ้ากรรมนายเวร อโหสิกรรม เผื่อจะทุเลาเบาบางลงบ้าง ตอนนี้ก็จิตตก อยู่คนเดียว สู้คนเดียว 😭😭😭😭",
                        "ทำยังไงดีตอนนี้หนูไม่ไหวแล้ว กลัวเป็นเนื้องอกในสมอง หน้าซีกขวาหนูชาลามยันคอ ได้ยินเสียในหูข้างขวามาเป็นเดือนแล้ว  หนูไม่รู้ว่าเป็นเพราะฟันผุไหม ความคิดหนูไม่ไหวแล้ว ไปหาหมอค่าใช้จ่ายสูงแน่😥😥😥😥😥",
                    ]
                },
                {
                    label: "Access to healthcare (Willing / Unwilling)",
                    children: [],
                    examples: [
                        "\"รู้สึกเคว้งคว้างมา เกือบๆจะปีแล้วครับ มันเบื่อ เศร้า เสียใจ โกรธ ผสมกันมาแบบนี้ตลอด อยากมีเพื่อนคุยเพื่อนเล่นก็ไม่มีเลยสักคน ชีวิตมันดูน่าเบื่อ ไร้ค่า อยู่ไปวันๆ อยากนอนไหลตายไปเลย อยากหลับไม่ตื่นอีก ทุกวันนี้ก็ติดฟังเพลงธรณีกรรแสงนอนทุกๆคืน ผมควรไปหาหมอดีมั้ยครับ พยายามทำให้เหมือนปกติทุกๆอย่าง ไม่อยากให้คนรอบข้างรับรู้ พยายามยิ้ม หัวเราะให้ปกติที่สุดแล้ว\",",
                        "เราเครียดมาก เราทำหน้าอกมา4ปีแล้ว  วันนี้คล่ำนมตัวเองแล้วเหมือนมีก้อนเนื้อแข็งๆ  จิตตกมาก กลัวไปหมด ฟุ้งซ่าน กลัวเป็นมะเร็ง ไม่อยากไปหาหมอเลย กลัวรับไม่ได้ 😭😭😭😭 ปวดหัวมาก",
                    ]
                },
                
            ]
        },
        {
            label: "Obsession/Overthinking",
            children: [
                {
                    label: "Other people's action",
                    children: [],
                    examples: [
                        "ปรึกษาอีกแล้วค่ะ​ และตอนนี้ยังอยู่โรงบาลเหมือนเดิมด้วยค่ะ5555\n\nคือว่าเราสังเกตว่ามีพี่ผู้หญิงคนนึงนอนอยู่เตียง10​ เขาชอบมองเราอะค่ะ​ มองแบบจ้องเลย​ แล้วบางทีเราหันไปสบตากับเขาหลายรอบมาก​ ตอนนั้นเราเลยมองกลับ​ จะดูว่า​เขาหลบตาไหม​ ก็ไม่หลบ​ เรากินข้าวอยู่เขาก็มอง​ บางทีเขาก็นอนพลิกตัวหันมาทางเตียงเราแล้วคลุมโปงเหลือแต่ลูกกะตา​ แล้วก็มองมาทางเราอีก​ หลอนมาก\n\nเราก็เลยเริ่มรู้สึกอึดอัดปนกลัวแล้วค่ะ​ เพราะปกติไม่ชอบให้คนมามองแบบจ้องตลอดเวลาขนาดนี้​ จะทำอะไรอยู่ก็ไม่รู้ว่าโดนมองอยู่รึป่าว​ แล้วทำไมต้องจ้องเราขนาดนั้น​ เราก็คิดก็ไม่เคยทำอะไรให้นะ​​ บางทีเห็นให้นมลูกอยู่ยังจ้องเราเลย(อะไรจะขนาดนั้น)​ คือตอนนี้ค่อนข้างไม่สบายใจเลยค่ะ​ เราควรถามเขาตรงๆดีไหมคะ​ หรือว่าควรปล่อยไปอีกเหมือนเดิม555🥹",
                        "ขอคำแนะนำหน่อยค่ะ\nเราเป็นผู้ป่วยซึมเศร้า ที่มีนิสัยคิดมากกับคำพูดคนอื่น แบบใครพูดไม่เข้าหู หรือเสียงดัง บางทีมันอาจไม่มีอะไรเลย แต่เราก็เก็บมาคิดน้อยใจ ดาวน์ มีใครเคยเป็นเหมือนเราไหมคะ จะแก้ยังไงดี บางทีก็สงสารแฟนค่ะที่ต้องมาทะเลาะด้วยเรื่องไม่เป็นเรื่อง กลัวเค้าทนไม่ไหว"
                    ]
                },
                {
                    label: "Too many problems (ปัญหาลุมเร้า)",
                    children: [],
                    examples: [
                        "ไม่ไหวเลย เครียดมาก ไหนจะเรื่องครอบครัว การเรียน เเล้วไหนจะสอบอีก รู้สึกเป็นตัวถ่วงเลยอ่ะ เเล้วเวลาเล่าอะไรก็ไม่มีใครเข้าใจเลย ทำอะไรมันก็รู้สึกไม่ค่อยมั่นใจในตัวเองไปเเล้ว😭",
                        
                    ]
                },
                {
                    label: "Unidentify illness",
                    children: [],
                    examples: [
                        "ช่วงนี้ปวดคอบ่าไหล่ ครั่นเนื้อครั่นตัว จนนอนไม่หลับ กังวลจัง ว่าเราเป็นโรคอะไรไหม ตอนนี้ต้องลุกมานั่ง นอนไม่ได้เลย",
                        "ตอนนี้เหมือนคนบ้าเลยค่ะ สับสนไปหมดว่ามันอาการเเพนิค หรือฮิทสโตรก กลัวมาก ร้อนวูบวาบ หายใจไม่ทันเหมือนคนจะตาย มีโรคต่างๆเข้ามาเรื่อยๆ ตอนนี้จะเป็นบ้าตายเเล้ว กลัวไปหมด อาการมาตั้งเเต่เมื่อคืนนอนไม่ได้ หายใจติดขัดเหมือนคนขาดอากาศหายใจ อากาศก็ร้อน😢😥😥😭😭"
                    ]
                },
                {
                    label: "Past Mistakes",
                    children: [],
                    examples: [
                        "ตกงาน ฉันก็ผ่านมาแล้ว\nร้องไห้ไม่อายหมอ เพราะเห็นแมวเจ็บ เค้าใส่สายฉี่ให้แมว แต่สุดท้ายแมวก็ไม่รอด ฉันก็ผ่านมาแล้ว\nอกหัก ฉันก็ผ่านมาแล้ว\nแล้วตอนนี้กำลังเผชิญกับเลือดคั่งในสมองจนต้องผ่า ความยุติธรรมก็ไม่ได้ รถที่รักมากๆคันนึงก็พังเสียหาย แมวก็จากไป กระแต ก็จากไป งานที่ผ่านโปรพอดีก็กลายเป็นตกงาน เพราะเกิดอุบัติเหตุขึ้นกับตัวฉัน ร่างกายก็ไม่เหมือนเดิม ขอโทษนะชีวิต ที่ทำให้แกต้องมาเจออะไรแบบนี้😢",
                    ]
                },
                
            ]
        },
        {
            label: "Panic",
            children: [],
            examples: [
                "เป็นแพนิคถึงขั้นไม่กล้ากินข้าวไม่อยากกินข้าวกลัวอาหารติดคอ มันเป็นอะไรที่แย่มาก😔",
                "เเชร์ประสบการณ์ เป็นเเพนิคบนเครื่องบินครับ\nตอนนั้น บินจาก ภูเก็ต-มาเลเซีย เวลาบิน 1ชม.กว่าๆครับ อาการคือ พอเครื่องเริ่มขึ้น อาการมาเลย ตัวร้อน หายใจไม่สะดวก ปากซีด จะวูบ อยู่ ตลอด ทรมานสุดๆ อยากจะรีบลงจอดสักที ตัวผมเคยนั่งเครื่องบินรอบนึง ที่มีประสบปัญหาที่เเย่ เจอหลุดอาการตั้งเเต่ขึ้น ฝนตกหนักพายุเข้า ตอนนั้นตกหลุมอาการค่อนข้างที่จะเเรงมาก ทุกคนกรี้ด มีคนนั่งร้องไห้ เป็นเเพนิค ตั้งเเต่วันนั้น ถึงวันนี้ไปที่ไปมาเลเซีย นรกเเตกมาก เพื่อนวิ่งหายาให้ทั้งเครื่องครับ 😂ความจริงตอนนั้นคือตลกไม่ออกเลยน่ะ ขากลับ โดนยานอนหลับเข้าไปหลับยาวจนถึง ภูเก็ต ปลอดภัยครับ \n-อยากหายสักทีครับเหนื่อยมากๆ🥲ทรมาน พึ่งอายุ21ปีครับ😂",
            ]
        }
    ]
}