import { TreeNode } from "../index"

export const relativeRelationship: TreeNode = {
    label: "Relative Relationship",
    children: [
        {
            label: "Parents (พ่อแม่)",
            children: [
                {
                    label: "conflict",
                    children: [],
                    isLeaf: true,
                    examples: [
                        "ขออนุญาตสอบถามนะคะหนูอายุ13ทนอยู่กับครอบครัวที่ค่อนข้างtoxicเค้าชอบเอาหนูไปเปรียบเทียบกับทุกคนทำเหมือนหนูไม่มีอะไรดีเลยตลอดที่เกิดมาหนูเป็นน้องเล็กสุดแต่แบกคำพูดคำโดนด่าโดนดูถูกทั้งหมดเลยค่ะหนูอยากให้ครอบครัวใจดีกับหนูบ้างหนูไม่เคยมีความสุขเลยค่ะ☹️",
                    ]
                },
                {
                    label: "gratitude",
                    children: [],
                    isLeaf: true,
                    examples: [
                        `ขอปรึกษาพี่ๆหน่อยค่ะ พอดีหนูใกล้จะเรียนจบแล้วค่ะ แต่ที่บ้านบอกกำชับว่าเราต้องให้เงินเดือนเขา 50,000 บาทขึ้นไป เพราะ 12,000 หรือ 20,000 บาท น้อยไป 

                        บ้านเราพ่อแม่มีธุรกิจของตัวเองเขาจะกำชับตลอดว่าคนรู้จักเขาเงินเดือน 300,000 บาท ให้พ่อแม่กินหรูอยู่สบายได้ อันนี้ทำให้เราเครียดกว่าเดิม คนใกล้ตัวหรือรุ่นพี่บอกว่ามันยาก
                        
                        เค้าฟังมาจากคนรู้จักมีฐานะว่าลูกให้เงินเดือนพ่อแม่หลักแสน พอลูกเรียนจบพ่อแม่เกษียรไม่ต้องทำงานกันแล้ว ไปใช้เงินสบาย ๆ ได้เลยเรียนจบเลี้ยงพ่อแม่ได้เลย แต่เรายังเลี้ยงไม่ได้ใกล้จะจบยังไปจุดนี้ไม่ได้เลยค่ะ ที่เราวางแผนคือเก็บเดือนละ10,000 บาท ที่เหลือให้พ่อแม่ เขาเองก็ไม่ได้ลำบาก พอฟังจากลูกคนมีฐานะในสังคมเราโดนเขากดตลอดแบบนี้เราเสียใจเหมือนกัน ทำได้แค่เงียบ
                        
                        เราขออ่านและนำคอมเม้นต์บางคอมเม้นต์เอามาวิเคราะห์ตัวเองดูยังได้ประโยชน์มาพัฒนาตัวเอง เพราะบ้านเราไม่เปิดรับไม่ว่าจะพูดอะไร เงินหมื่นยังน้อยไปสำหรับบ้านเรา
                        
                        ใครคิดว่าเพ้อเจ้อหรืออะไรก็ไม่เป็นไรค่ะ อย่างน้อยมีคนให้กำลังใจให้ไม่ดิ่งก็ช่วยได้แล้ว
                        
                        ปล. เราเคยสมัครงานพาร์ทไทม์แต่ยูนิฟอร์มของที่สมัครพ่อเราบอกมันดูแก่ น่าเกลียด เขาก็ไม่ให้ทำ สรุปทำไปวันเดียวแล้วออก (บ้านเราตรรกะงี้จริง ๆ ) จะออกไปอยู่เองเจอ50,000 ต่อเดือนดำดิ่งค่ะ
                        
                        เรทจ้างพนักงานพี่ในออฟฟิศ 13,000-15,000 (เราไม่ได้หรือถ้าได้ก็ไม่ถึงหมื่นเพราะเป็นลูก แต่ปัญหาใดก็ตามเราจะโดนว่าก่อนตลอดทั้งที่ไม่ผิด ใช้งานแบกปัญหาหนักกว่า “เรียนจบไปทำงานบริษัทแกต้องได้หลักแสน” แค่หมื่นกว่าพ่อแม่ใช้ก็หมดแล้ว50,000ยังน้อยไปด้วยซ้ำ (พ่อแม่จำกัดต้องงานบริษัทห้ามออกไปต่างประเทศ)
                        
                        ถ้าไปต่างประเทศเขากลัวเราหนีเขา ทุกวันนี้โดนพ่อแม่พยายามปลูกฝังความกตัญญูรู้คุณกับเรา ไปที่อื่น=อกตัญญู   ไม่ดูแลพ่อแม่ออกไปอยู่เอง=เลว  ไปต่างประเทศ=วัวลืมตีน  ไม่ไปจะหาเงินหลักแสนจากไหนเราก็ต้องตั้งตัวเหมือนกัน🥲
                        
                        เครียดมากเพราะใกล้จะเรียนจบแล้ว เรียนเราเรียนคณะศิลปศาสตร์ โปรแกรมพอได้นิดหน่อยไม่ได้มืออาชีพ #JobThai`,
                    ]
                },
                {
                    label: "Parents are quarreling (พ่อแม่ทำเลาะกัน)",
                    children: [],
                    isLeaf: true,
                    examples: [
                        "สวัสดีคะ ตั้งแต่จำความได้เราเห็นพ่อกับแม่ทะเลาะกันมาตลอด จนตอนนี้เราจะ30 ปีแล้ว ก็ยังเป็นเหมือนเดิม เบื่อและรำคาญมากๆคะ เรื่องไม่เป็นเรื่อง สงสารลูกที่ต้องมานั่งฟัง คือว่าเราเลิกกันกับสามีนะคะ เราอยู่บ้านกับพ่อแม่ อยากออกไปจากตรงนี้แต่ติดที่ลูกยังเล็กอยู่ ไม่รู้จะทำยังไงเหนื่อยใจมากๆคะ",
                    ]
                },
                {
                    label: "Parents don't accept (พ่อแม่ไม่ยอมรับ)",
                    children: [],
                    isLeaf: true,
                    examples: [
                        "เราควรทำยังไงดีกับพ่อเเม่ที่ไม่เคยภูมิใจในสิ่งที่เราทำเต็มที่เเล้ว คือเราสอบราชการมารอบนี้คือรอบที่3 ผลออกไม่ได้กลับบ้านมา คำที่เขาพูดคือ ทำเหี้ยไรก็ไม่เคยสำเร็จ  ตั้งเเต่เรา18ได้ไม่กี่วัน เขาให้เราสอบราชการมาตลอด ไม่ว่าจะของอะไรที่เปิดรับ ตอนนี้เรา19 เราไม่เคยบ่นเราทำเต็มที่ตลอด เเต่เขากลับไม่เคยภูมิใจ เอาคนอื่นมาเปรียบเทียบตลอดว่าลูกคนนั้นยังได้ ทำได้ เห้ออ..",
                    ]
                }
            ]
        },
        {
            label: "ครอบครัวแฟน",
            children: [
                {
                    label: "conflict",
                    children: [],
                    isLeaf: true,
                    examples: [
                        "แม่ผัวด่าเราว่าตอเเหล ❗️เรื่องมาจากลูกเรา2ขวบจะกินลูกอม เราไม่อยากให้กินเดี๋ยวฟันพุเเม่ผัวเลยพูดประมาณ เเล้วใครซื้อ ประมาณเงินใครซื้อ (เงินเเฟนเราพึ่งเบิกมาวันนี้)”เราเลยพูดไปเงินใครซื้อมันไม่สำคัญหรอกแม่เเต่หนูไม่อยากให้กินมาก” แม่ผัวเลยพูดว่า ทำไมมึงจะมาตอเเหลอะไร อย่าตอเเหลให้มากนะมึง เราเลยพูดกับแฟน ”เธอดูเเม่เธอพูดกับเค้าสิ” แม่ผัวเลยด่าเรากลับต่อหน้าสามี ทำไม❗️มึงเป็นเเม่กูหรอ ผัวเราเลยบอกว่า”แม่ไปด่าเขาทำไม” เเม่ผัวก็พูดว่า “เข้าข้างเมียหรอ เอาขึ้นหิ้งสิลูก” ท้อเลยค่ะเจอเเบบนี้เห็นเเต่ในละคร",
                        "สวัสดีครับ ขอปรึกษา หน่อยครับ คือ ครอบครัวเมียผม มันไม่อยากให้ เมียผมทำงานช่วยกัน ผมทำงานคนเดียวเงินเดือน17,500ผ่อนทั้งบ้านทั้งรถรวมกินใช้จ่ายในครอบครัวทุกอย่าง มันพอนั้นแหละ แต่มันต้อง อยู่อย่างประหยัด วันไหนเมียผม คิดจะช่วยทำงานหาเงิน กลับมาเหนื่อยๆ เมียผมโดนแม่ของเข้าด่า ดูถูก ว่า ทำงานทำไม อยู่บ้านเลี้ยงลูกเถอะ ไม่ปวดหัวบ้างหรอเป็นหนี้ รถหนี้บ้าน ผมจะบอกอะไรให้  สมบัติ ของแม่มัน ไม่มี อะไรให้ลูกเลย ได้แต่ตอกย้ำซ้ำเติม ถ้าคิดจะ  ทำงานหาแดกไปวันๆ ไม่สร้างอะไร สบายครับ เงินเดือนผม เลี้ยงได้ สบาย 17,500ถ้าเอามากินอย่างเดียว แต่ไม่มี เหี้ยอะไรเลย น่ะ  พี่ๆคิดยังไง กับความคิด ของบ้านนั้น  ผมหนักใจ ไม่รู้จะไปต่อหรือพอแค่นี้"
                    ]
                },
                {
                    label: "The partner prioritizes their parents so much that they neglect their own family (แฟนให้ความสำคัญกับพ่อแม่จนไม่สนใจครอบครัวตัวเอง)",
                    children: [],
                    isLeaf: true,
                    examples: [
                        "แม่ผัวดีครอบครัวผัวดีได้ผัวที่ทำงานซื่อสัตย์ขยันแต่เขาหาเงินเพื่อจ่ายค่างวดรถตัวเองจ่ายหนี้แต่ของตัวเอง",
                        "เราควรทำไงดีค่ะสับสนแฟนเราฟังแต่ความข้างเดียวทั้งที่เรามาอาศัยยุบ้านเขา  เราพูดบอกอะไรเขาไม่ฟังเราเรา  แต่พ่อแม่เขาพูดแค่ทำเดียวเขาทำตามหมด  เราควรทำไงอึดอัด"
                    ]
                }
            ]
        },
        {
            label: "distance relative (ญาติห่างๆ)",
            children: [
                {
                    label: "conflict",
                    children: [],
                    isLeaf: true,
                    examples: [
                        "ทำไมครอบครัวเราไม่เหมือนคนเขาบ้างเวลามีปัญหา ไม่เคยมีใครคิดช่วยเราบ้างเลย บ้างครั้งขอ ความช่วยเหลือ นิดหน่อย ทำเหมือนเราสร้างปัญหาใหญ่โต ไม่มีคำปลอบใจ มีเเต่ด่าว่า เปรียบเทียบกับคนอื่นตลอดบ้างที เราก็น้อยใจนะ ทั้งๆที่เราไม่เคยขออะไรเลย รุ้สึกเหนื่อย😭😭😭😭",
                    ]
                },
            ]
        },
        {
            label: "stepparents (พ่อเลี้ยง, แม่เลี้ยง)",
            children: [
                {
                    label: "conflict",
                    children: [],
                    isLeaf: true,
                    examples: [
                        "หนูมีเรื่องปรึกษาอีกเรื่องนึงค่ะ ตัวหนูเนี่ยมีพ่อเลี้ยงแต่หนูไม่ค่อยสนิทกับเขามาก เขาเป็นคนชอบแซะชอบบังคับให้ไปตามเขาค่ะ แบบประมาณว่าถ้าชี้ให้เดินไปซ้ายก็ต้องไปซ้ายตามที่บอกอ่ะค่ะ เขาเป็นคนที่แบบใช้เหตุผลด้วยไม่ได้เลยสักรอบ บางทีหนูอยากจะมีโลกส่วนตัวบ้างเช่นแบบ เวลาคุยแชทหรือโทรแชทเขาจะพูดแทรกมาตลอดเลยค่ะ คุยกับใคร พอหนูตอบว่าเพื่อน เขาก็จะแบบคุยทำไมเพื่อนไม่ได้หาให้มึงกินประมาณนี้ค่ะ ละก็อีกอย่างเป็นคนชอบทวงบุญคุณมากๆๆ หนูไม่เข้าใจเลย อีกอย่างที่หนูไม่ชอบคือหนูเป็นผญ.ก็โตขึ้นทุกวันๆใช่มั้ยคะ เขาก็ชอบมากอด มาตีก้นหนูมาจับหน้าหนูไม่ชอบเลยค่ะ หนูควรทำยังไงหรอคะ😭😭😭",
                    ]
                }
            ]
        },
    ]
}